        IDENTIFICATION DIVISION. 
        PROGRAM-ID. MERGENSORT.
        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
        SELECT BSIT ASSIGN TO "BSIT.DAT".
        SELECT BSCS ASSIGN TO "BSCS.DAT".
        SELECT MERG ASSIGN TO "MERG.DAT".
        SELECT WORK ASSIGN TO "WORK.DAT".
        SELECT PRNT ASSIGN TO "PRNT.DAT".
        DATA DIVISION.
        FILE SECTION.
        FD BSIT LABEL RECORDS ARE STANDARD DATA RECORD IS BSIT-REC.
        01 BSIT-REC.
          02 BSIT-STUD-NM PIC X(15).
          02 BSIT-STUD-GD PIC 9(3).
        FD BSCS LABEL RECORDS ARE STANDARD DATA RECORD IS BSCS-REC.
        01 BSCS-REC.
          02 BSCS-STUD-NM PIC X(15).
          02 BSCS-STUD-GD PIC 9(3).
        FD MERG LABEL RECORDS ARE STANDARD DATA RECORD IS MERG-REC.
        01 MERG-REC.
          02 MERG-STUD-NM PIC X(15).
          02 MERG-STUD-GD PIC 9(3).
        SD WORK LABEL RECORDS ARE STANDARD DATA RECORD IS WORK-REC.
        01 WORK-REC.
          02 WORK-STUD-NM PIC X(15).
          02 WORK-STUD-GD PIC 9(3).
        FD PRNT LABEL RECORDS ARE STANDARD DATA RECORD IS PRNT-REC.
        01 PRNT-REC PIC X(80).
        WORKING-STORAGE SECTION. 
        01 NUM PIC 999 VALUE ZERO.
        01 TOTAL PIC 9(5) VALUE ZERO.
        01 EOF PIC 9 VALUE ZERO.
        01 HDG-1.
          02 FILLER PIC X(20) VALUE "STUDENT NAME".
          02 FILLER PIC X(5) VALUE "GRADE".
        01 PRTLN.
          02 PRNT-STUD-NM PIC X(15).
          02 FILLER PIC X(5) VALUE SPACES.
          02 PRNT-STUD-GD PIC 9(3).
        01 AVG.
          02 FILLER PIC X(20) VALUE "AVERAGE GRADE".
          02 PRT-AVG-GD PIC Z(3).
        PROCEDURE DIVISION.
          MERGE WORK 
            ON DESCENDING KEY WORK-STUD-GD
            ON ASCENDING KEY WORK-STUD-NM
              USING BSIT, BSCS GIVING MERG.
          OPEN INPUT MERG, OUTPUT PRNT.
          WRITE PRNT-REC FROM HDG-1.
          READ MERG AT END MOVE 1 TO EOF.
          PERFORM READ-RTN UNTIL EOF = 1.
          IF EOF = 1 PERFORM FINAL-RTN
          STOP RUN.

          READ-RTN. 
          COMPUTE TOTAL = TOTAL + MERG-STUD-GD.
          MOVE MERG-STUD-NM TO PRNT-STUD-NM.
          MOVE MERG-STUD-GD TO PRNT-STUD-GD.
          WRITE PRNT-REC FROM PRTLN AFTER 1 LINE.
          READ MERG AT END MOVE 1 TO EOF.
          ADD 1 TO NUM.

          FINAL-RTN.
          COMPUTE NUM = TOTAL / NUM.
          MOVE NUM TO PRT-AVG-GD.
          WRITE PRNT-REC FROM AVG AFTER 1 LINE.
          CLOSE MERG, PRNT.
          